package com.didalgo.gpt3;

import org.junit.jupiter.params.ParameterizedTest;
import org.junit.jupiter.params.converter.ConvertWith;
import org.junit.jupiter.params.provider.CsvSource;

import java.util.List;

import static org.junit.jupiter.api.Assertions.*;

class GPT3TokenizerTest {

    @ParameterizedTest
    @CsvSource({
            "gpt-4, 'Stop!', '[10903, 0]'",
            "gpt-4, 'Stop now.', '[10903, 1457, 13]'",
            "gpt-4, 'Stop what you''re doing.', '[10903, 1148, 499, 2351, 3815, 13]'",
            "gpt-4, 'Stop what you''re doing right now.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 13]'",
            "gpt-4, 'Stop what you''re doing right now and listen.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 13]'",
            "gpt-4, 'Stop what you''re doing right now and listen carefully.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 15884, 13]'",
            "gpt-4, 'Stop what you''re doing right now and listen carefully to me.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 15884, 311, 757, 13]'",
            "gpt-4, 'Stop what you''re doing right now and listen carefully to me, please.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 15884, 311, 757, 11, 4587, 13]'",
            "gpt-4, 'Stop what you''re doing right now and listen carefully to me, please, because this is important.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 15884, 311, 757, 11, 4587, 11, 1606, 420, 374, 3062, 13]'",
            "gpt-4, 'Stop what you''re doing right now and listen carefully to me, please, because this is very important.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 15884, 311, 757, 11, 4587, 11, 1606, 420, 374, 1633, 3062, 13]'",
            "gpt-4, 'Przestań!', '[3617, 89, 30279, 19699, 0]'",
            "gpt-4, 'Przerwij to.', '[3617, 7215, 87183, 311, 13]'",
            "gpt-4, 'Przerwij to, co robisz.', '[3617, 7215, 87183, 311, 11, 1080, 10773, 70828, 13]'",
            "gpt-4, 'Przerwij to, co teraz robisz.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 13]'",
            "gpt-4, 'Przerwij to, co teraz robisz i posłuchaj.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 13]'",
            "gpt-4, 'Przerwij to, co teraz robisz i posłuchaj uważnie.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 577, 10196, 6077, 11044, 13]'",
            "gpt-4, 'Przerwij to, co teraz robisz i posłuchaj mnie uważnie.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 74173, 577, 10196, 6077, 11044, 13]'",
            "gpt-4, 'Przerwij to, co teraz robisz i posłuchaj mnie uważnie, proszę.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 74173, 577, 10196, 6077, 11044, 11, 8882, 60705, 13]'",
            "gpt-4, 'Przerwij to, co teraz robisz i posłuchaj mnie proszę uważnie, bo to ważne.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 74173, 8882, 60705, 577, 10196, 6077, 11044, 11, 712, 311, 10667, 6077, 818, 13]'",
            "gpt-4, 'Przerwij to, co teraz robisz i posłuchaj mnie proszę uważnie, bo to bardzo ważne.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 74173, 8882, 60705, 577, 10196, 6077, 11044, 11, 712, 311, 57958, 10667, 6077, 818, 13]'",
            "gpt-4, 'СТІЙ!', '[19871, 35095, 140, 228, 140, 247, 0]'",
            "gpt-4, 'Припини зараз.', '[17279, 31203, 8164, 19479, 1840, 44946, 89554, 13]'",
            "gpt-4, 'Припини те, що ти робиш.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 18600, 14082, 1840, 12426, 13]'",
            "gpt-4, 'Припини те, що ти робиш зараз.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 18600, 14082, 1840, 12426, 44946, 89554, 13]'",
            "gpt-4, 'Припини те, що ти зараз робиш, і послухай.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 61813, 3865, 10693, 19039, 13]'",
            "gpt-4, 'Припини те, що ти зараз робиш, і уважно слухай.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 14257, 5591, 38657, 13999, 35875, 3865, 10693, 19039, 13]'",
            "gpt-4, 'Припини те, що ти зараз робиш, і вислухай мене уважно.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 5927, 13810, 3114, 3865, 10693, 19039, 69844, 1532, 14257, 5591, 38657, 13999, 13]'",
            "gpt-4, 'Припини те, що ти зараз робиш, і вислухай мене уважно, будь ласка.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 5927, 13810, 3114, 3865, 10693, 19039, 69844, 1532, 14257, 5591, 38657, 13999, 11, 51570, 4929, 26539, 18437, 13433, 13]'",
            "gpt-4, 'Припини те, що ти зараз робиш, і вислухай мене уважно, будь ласка, тому що це важливо.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 5927, 13810, 3114, 3865, 10693, 19039, 69844, 1532, 14257, 5591, 38657, 13999, 11, 51570, 4929, 26539, 18437, 13433, 11, 11047, 72952, 9015, 231, 1482, 39233, 1532, 5927, 38657, 11320, 5591, 1482, 13]'",
            "gpt-4, 'Припини те, що ти зараз робиш, і слухай мене уважно, бо це дуже важливо.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 35875, 3865, 10693, 19039, 69844, 1532, 14257, 5591, 38657, 13999, 11, 14391, 1482, 39233, 1532, 7952, 56999, 1532, 5927, 38657, 11320, 5591, 1482, 13]'",
            "gpt-4, 'class MyClass { public static void main(String[] args) { System.out.println(\"Hello, world!\"); }}', '[1058, 84926, 314, 586, 1118, 742, 1925, 2292, 1318, 2897, 8, 314, 744, 2594, 2986, 446, 9906, 11, 1917, 86640, 3954]'",
            "gpt-3.5-turbo, 'Stop!', '[10903, 0]'",
            "gpt-3.5-turbo, 'Stop now.', '[10903, 1457, 13]'",
            "gpt-3.5-turbo, 'Stop what you''re doing.', '[10903, 1148, 499, 2351, 3815, 13]'",
            "gpt-3.5-turbo, 'Stop what you''re doing right now.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 13]'",
            "gpt-3.5-turbo, 'Stop what you''re doing right now and listen.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 13]'",
            "gpt-3.5-turbo, 'Stop what you''re doing right now and listen carefully.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 15884, 13]'",
            "gpt-3.5-turbo, 'Stop what you''re doing right now and listen carefully to me.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 15884, 311, 757, 13]'",
            "gpt-3.5-turbo, 'Stop what you''re doing right now and listen carefully to me, please.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 15884, 311, 757, 11, 4587, 13]'",
            "gpt-3.5-turbo, 'Stop what you''re doing right now and listen carefully to me, please, because this is important.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 15884, 311, 757, 11, 4587, 11, 1606, 420, 374, 3062, 13]'",
            "gpt-3.5-turbo, 'Stop what you''re doing right now and listen carefully to me, please, because this is very important.', '[10903, 1148, 499, 2351, 3815, 1314, 1457, 323, 9020, 15884, 311, 757, 11, 4587, 11, 1606, 420, 374, 1633, 3062, 13]'",
            "gpt-3.5-turbo, 'Przestań!', '[3617, 89, 30279, 19699, 0]'",
            "gpt-3.5-turbo, 'Przerwij to.', '[3617, 7215, 87183, 311, 13]'",
            "gpt-3.5-turbo, 'Przerwij to, co robisz.', '[3617, 7215, 87183, 311, 11, 1080, 10773, 70828, 13]'",
            "gpt-3.5-turbo, 'Przerwij to, co teraz robisz.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 13]'",
            "gpt-3.5-turbo, 'Przerwij to, co teraz robisz i posłuchaj.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 13]'",
            "gpt-3.5-turbo, 'Przerwij to, co teraz robisz i posłuchaj uważnie.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 577, 10196, 6077, 11044, 13]'",
            "gpt-3.5-turbo, 'Przerwij to, co teraz robisz i posłuchaj mnie uważnie.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 74173, 577, 10196, 6077, 11044, 13]'",
            "gpt-3.5-turbo, 'Przerwij to, co teraz robisz i posłuchaj mnie uważnie, proszę.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 74173, 577, 10196, 6077, 11044, 11, 8882, 60705, 13]'",
            "gpt-3.5-turbo, 'Przerwij to, co teraz robisz i posłuchaj mnie proszę uważnie, bo to ważne.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 74173, 8882, 60705, 577, 10196, 6077, 11044, 11, 712, 311, 10667, 6077, 818, 13]'",
            "gpt-3.5-turbo, 'Przerwij to, co teraz robisz i posłuchaj mnie proszę uważnie, bo to bardzo ważne.', '[3617, 7215, 87183, 311, 11, 1080, 2024, 1394, 10773, 70828, 602, 1153, 4697, 1412, 1662, 74173, 8882, 60705, 577, 10196, 6077, 11044, 11, 712, 311, 57958, 10667, 6077, 818, 13]'",
            "gpt-3.5-turbo, 'СТІЙ!', '[19871, 35095, 140, 228, 140, 247, 0]'",
            "gpt-3.5-turbo, 'Припини зараз.', '[17279, 31203, 8164, 19479, 1840, 44946, 89554, 13]'",
            "gpt-3.5-turbo, 'Припини те, що ти робиш.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 18600, 14082, 1840, 12426, 13]'",
            "gpt-3.5-turbo, 'Припини те, що ти робиш зараз.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 18600, 14082, 1840, 12426, 44946, 89554, 13]'",
            "gpt-3.5-turbo, 'Припини те, що ти зараз робиш, і послухай.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 61813, 3865, 10693, 19039, 13]'",
            "gpt-3.5-turbo, 'Припини те, що ти зараз робиш, і уважно слухай.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 14257, 5591, 38657, 13999, 35875, 3865, 10693, 19039, 13]'",
            "gpt-3.5-turbo, 'Припини те, що ти зараз робиш, і вислухай мене уважно.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 5927, 13810, 3114, 3865, 10693, 19039, 69844, 1532, 14257, 5591, 38657, 13999, 13]'",
            "gpt-3.5-turbo, 'Припини те, що ти зараз робиш, і вислухай мене уважно, будь ласка.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 5927, 13810, 3114, 3865, 10693, 19039, 69844, 1532, 14257, 5591, 38657, 13999, 11, 51570, 4929, 26539, 18437, 13433, 13]'",
            "gpt-3.5-turbo, 'Припини те, що ти зараз робиш, і вислухай мене уважно, будь ласка, тому що це важливо.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 5927, 13810, 3114, 3865, 10693, 19039, 69844, 1532, 14257, 5591, 38657, 13999, 11, 51570, 4929, 26539, 18437, 13433, 11, 11047, 72952, 9015, 231, 1482, 39233, 1532, 5927, 38657, 11320, 5591, 1482, 13]'",
            "gpt-3.5-turbo, 'Припини те, що ти зараз робиш, і слухай мене уважно, бо це дуже важливо.', '[17279, 31203, 8164, 19479, 1840, 11047, 1532, 11, 9015, 231, 1482, 11047, 1840, 44946, 89554, 18600, 14082, 1840, 12426, 11, 84954, 35875, 3865, 10693, 19039, 69844, 1532, 14257, 5591, 38657, 13999, 11, 14391, 1482, 39233, 1532, 7952, 56999, 1532, 5927, 38657, 11320, 5591, 1482, 13]'",
            "gpt-3.5-turbo, 'class MyClass { public static void main(String[] args) { System.out.println(\"Hello, world!\"); }}', '[1058, 84926, 314, 586, 1118, 742, 1925, 2292, 1318, 2897, 8, 314, 744, 2594, 2986, 446, 9906, 11, 1917, 86640, 3954]'"
    })
    void can_encode_or_decode_test_vectors_correctly(String model,
                                                     String text,
                                                     @ConvertWith(ListConverter.class) List<Integer> tokens) {
        var enc = new GPT3Tokenizer(Encoding.forModel(model));
        assertEquals(tokens, enc.encode(text));
        assertEquals(text, enc.decode(tokens));
    }
}